{"keras_version": "2.0.8", "config": [{"config": {"kernel_constraint": null, "name": "conv2d_1", "kernel_regularizer": null, "filters": 32, "activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "batch_input_shape": [null, 50, 185, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "name": "conv2d_2", "kernel_regularizer": null, "filters": 64, "activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "name": "conv2d_3", "kernel_regularizer": null, "filters": 64, "activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_3", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 512, "activity_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 296, "activity_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}