{"config": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activation": "linear", "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "batch_input_shape": [null, 50, 185, 1], "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "filters": 32, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_constraint": null, "trainable": true, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 512, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_constraint": null, "trainable": true, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 288, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential"}