{"config": [{"config": {"bias_constraint": null, "strides": [1, 1], "batch_input_shape": [null, 50, 185, 1], "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "dtype": "float32", "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "conv2d_2"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "conv2d_3"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "units": 512, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "units": 36, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_5"}, "class_name": "Activation"}], "keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow"}